In [ ]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame()
df2 = pd.DataFrame()

In [ ]:
df1['viewers'] = ['Bob','Mike','Doe','foo']
df2['users']= ['Bob','cornelius','Doe','Adityu','vishnu']

In [ ]:
np.random.seed(1729)
df1 = df1.assign(views = np.random.normal(100,100,4))
df2 = df2.assign(cost = [20,np.nan,15,2,7])

In [ ]:
df1

In [ ]:
#left Join
df3 = df1.merge(df2,left_on='viewers',right_on='users',how='left')

In [ ]:
df1

  viewers       views
0     Bob   31.266056
1    Mike   17.900529
2     Doe  265.236086
3     foo   42.470696

In [ ]:
df2

       users  cost
0        Bob  20.0
1  cornelius   NaN
2        Doe  15.0
3     Adityu   2.0
4     vishnu   7.0

In [ ]:
df3

  viewers       views users  cost
0     Bob   31.266056   Bob  20.0
1    Mike   17.900529   NaN   NaN
2     Doe  265.236086   Doe  15.0
3     foo   42.470696   NaN   NaN

In [ ]:
df3.fillna(df3.mean(),inplace=True)

In [ ]:
df3